tests/result_artillery.txt
Phase started: unnamed (index: 0, duration: 1s) 22:03:54(-0300)

Phase completed: unnamed (index: 0, duration: 1s) 22:03:55(-0300)

--------------------------------------
Metrics for period to: 22:04:00(-0300) (width: 4.958s)
--------------------------------------

http.codes.200: ................................................................ 271
http.request_rate: ............................................................. 65/sec
http.requests: ................................................................. 321
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 1790
  median: ...................................................................... 907
  p95: ......................................................................... 1107.9
  p99: ......................................................................... 1587.9
http.responses: ................................................................ 271
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50


--------------------------------------
Metrics for period to: 22:04:10(-0300) (width: 9.241s)
--------------------------------------

http.codes.200: ................................................................ 545
http.request_rate: ............................................................. 59/sec
http.requests: ................................................................. 545
http.response_time:
  min: ......................................................................... 178
  max: ......................................................................... 2776
  median: ...................................................................... 963.1
  p95: ......................................................................... 1043.3
  p99: ......................................................................... 1978.7
http.responses: ................................................................ 545


--------------------------------------
Metrics for period to: 22:04:20(-0300) (width: 9.169s)
--------------------------------------

http.codes.200: ................................................................ 602
http.request_rate: ............................................................. 66/sec
http.requests: ................................................................. 602
http.response_time:
  min: ......................................................................... 116
  max: ......................................................................... 2013
  median: ...................................................................... 944
  p95: ......................................................................... 1176.4
  p99: ......................................................................... 1939.5
http.responses: ................................................................ 602


--------------------------------------
Metrics for period to: 22:04:30(-0300) (width: 9.157s)
--------------------------------------

http.codes.200: ................................................................ 582
http.request_rate: ............................................................. 58/sec
http.requests: ................................................................. 532
http.response_time:
  min: ......................................................................... 51
  max: ......................................................................... 2963
  median: ...................................................................... 944
  p95: ......................................................................... 1002.4
  p99: ......................................................................... 1939.5
http.responses: ................................................................ 582
vusers.completed: .............................................................. 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 31861.5
  max: ......................................................................... 34598.3
  median: ...................................................................... 33199.7
  p95: ......................................................................... 33870.4
  p99: ......................................................................... 34554.7


All VUs finished. Total time: 37 seconds

--------------------------------
Summary report @ 22:04:31(-0300)
--------------------------------

http.codes.200: ................................................................ 2000
http.request_rate: ............................................................. 62/sec
http.requests: ................................................................. 2000
http.response_time:
  min: ......................................................................... 2
  max: ......................................................................... 2963
  median: ...................................................................... 944
  p95: ......................................................................... 1085.9
  p99: ......................................................................... 1978.7
http.responses: ................................................................ 2000
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.0: ...................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 31861.5
  max: ......................................................................... 34598.3
  median: ...................................................................... 33199.7
  p95: ......................................................................... 33870.4
  p99: ......................................................................... 34554.7